# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [2]:
df = pd.DataFrame()

for i in range(10):
    info = pd.read_csv('Students_info_' + str(i) + '.csv')
    marks = pd.read_csv('Students_marks_' + str(i) + '.csv')
    df = df.append(info.merge(marks, on='index'))

df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...,...
95,995,female,group E,master's degree,standard,completed,group10,88,99,95
96,996,male,group C,high school,free/reduced,none,group10,62,55,55
97,997,female,group C,high school,free/reduced,completed,group10,59,71,65
98,998,female,group D,some college,standard,completed,group10,68,78,77
99,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [3]:
df = df.drop('index', axis = 1)

In [4]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [5]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [6]:
df.describe().loc[['min','max','mean','std']]

      math score  reading score  writing score
min      0.00000      17.000000      10.000000
max    100.00000     100.000000     100.000000
mean    66.08900      69.169000      68.054000
std     15.16308      14.600192      15.195657

In [7]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [8]:
df.isnull().sum().sum()

0

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [9]:
print('math mean is', df['math score'].mean())
print('reading mean is', df['reading score'].mean())
print('writing mean is', df['writing score'].mean())

math mean is 66.089
reading mean is 69.169
writing mean is 68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [10]:
df.groupby('test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [11]:
df.lunch.value_counts()

standard        645
free/reduced    355
Name: lunch, dtype: int64

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [12]:
df = df.rename(columns={
    'parental level of education' : 'education',
    'test preparation course' : 'test preparation'})

**Зафиксируем минимальный балл для сдачи экзамена**

In [13]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [14]:
print('доля студентов сдала экзамен по математике -',
     df[df['math score'] >= passmark].shape[0] / df.shape[0])

print('доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?',
     round(df[(df['test preparation'] == 'completed') & (df['math score'] >= 50)].shape[0] / 
          df[df['test preparation'] == 'completed'].shape[0],2))

print('доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике',
     round(df[(df['gender'] == 'female') & (df['test preparation'] == 'none') & 
              (df['math score'] < passmark)].shape[0] / 
           df[(df['gender'] == 'female') & (df['test preparation'] == 'none')].shape[0],2))

доля студентов сдала экзамен по математике - 0.865
доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике? 0.92
доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике 0.21

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [15]:
%%time
df.groupby('race/ethnicity')['reading score'].mean()

Wall time: 2.99 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [16]:
%%time
df.groupby('education')['reading score'].min()

Wall time: 2.99 ms

education
associate's degree    31
bachelor's degree     41
high school           24
master's degree       42
some college          23
some high school      17
Name: reading score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [17]:
%%time
for i in df['race/ethnicity'].unique():
    print(i, df[df['race/ethnicity'] == i]['reading score'].mean())

group B 67.35263157894737
group C 69.10344827586206
group A 64.67415730337079
group D 70.03053435114504
group E 73.02857142857142
Wall time: 11 ms

In [18]:
%%time
for i in df['education'].unique():
    print(i, df[df['education'] == i]['reading score'].min())

bachelor's degree 41
some college 23
master's degree 42
associate's degree 31
high school 24
some high school 17
Wall time: 8.98 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [19]:
df.pivot_table(index=['gender','education'])

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [20]:
df['Math_PassStatus'] = df['math score'] >= passmark
df['Math_PassStatus'] = df['Math_PassStatus'].map({True : 'P', False : 'F'})
df.Math_PassStatus.value_counts()

P    865
F    135
Name: Math_PassStatus, dtype: int64

In [21]:
df['Read_PassStatus'] = df['reading score'] >= passmark
df['Read_PassStatus'] = df['Read_PassStatus'].map({True : 'P', False : 'F'})
df.Read_PassStatus.value_counts()

P    910
F     90
Name: Read_PassStatus, dtype: int64

In [22]:
df['Write_PassStatus'] = df['writing score'] >= passmark
df['Write_PassStatus'] = df['Write_PassStatus'].map({True : 'P', False : 'F'})
df.Write_PassStatus.value_counts()

P    886
F    114
Name: Write_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [23]:
df['OverAll_PassStatus'] = \
    df['Math_PassStatus'] + df['Read_PassStatus'] + df['Write_PassStatus']

df.loc[df['OverAll_PassStatus'] == 'PPP','OverAll_PassStatus'] = 'P'
df.loc[df['OverAll_PassStatus'] != 'P','OverAll_PassStatus'] = 'F'

df.OverAll_PassStatus.value_counts()

P    812
F    188
Name: OverAll_PassStatus, dtype: int64

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [24]:
def GetGrade(average_mark):
    if average_mark > 90:
        return 'A'
    elif 90 > average_mark >= 80:
        return 'B'
    elif 80 > average_mark >= 70:
        return 'C'
    elif 70 > average_mark >= 60:
        return 'D'
    elif 50 > average_mark >= 60:
        return 'E'
    else:
        return 'F'
    

df['avg_marks'] = \
    (df['math score'] + df['reading score'] + df['writing score']) / 3

df['Grade'] = df['avg_marks'].apply(GetGrade)
df.Grade.value_counts()

F    287
C    261
D    256
B    146
A     50
Name: Grade, dtype: int64